examples/2d_yeast_with_free_interface/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            noSlip;
    }
    top 
    {
	type 		slip; 
	// Free interface, except where the yeast are
	// No flux in z, but flow allowed in x & y.
    }
    yeast_top
    {
	type 		noSlip;
    }
    left
    {
        type            noSlip;
    }
    right
    {
	type		noSlip;
    }
}


// ************************************************************************* //
