examples/2d_yeast_with_free_interface/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];
internalField   uniform 1.0; //There are nutrients everywhere at first

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    yeast_top
    {
	type		fixedValue;
	value 		uniform 0.0;
    }
    top
    {
	type 		zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
